### Importing Dependencies

In [1]:
# Import denpendencies
from pathlib import Path
import pandas as pd
import os

### Importing Data Files

In [2]:
# reading files in dataframe
# create empty dictionary to hold data
store_data = {}
# define file paths
# define file path
file_paths = {"train":"../Resources/train.csv",
            "holidays_events":"../Resources/holidays_events.csv",
            "oil":"../Resources/oil.csv",
            "stores":"../Resources/stores.csv",
            "transactions":"../Resources/transactions.csv"}
# read and store each file data in the store_data list.
for data_file,relative_path in file_paths.items():
    # create absolute path for each file
    file_path = os.path.abspath(relative_path)
    # read and store file in dictionary
    try:
        store_data[data_file] = pd.read_csv(file_path, low_memory=False)
        print(f'{data_file} loaded successfully.')
    except FileNotFoundError:
        print(f"Error: {data_file} not found.")
    except Exception as e:
        print(f"An error occured while loading data{e}")

train loaded successfully.
holidays_events loaded successfully.
oil loaded successfully.
stores loaded successfully.
transactions loaded successfully.

### Data Cleaning

In [3]:
holidays_evets = store_data["holidays_events"]
holidays_evets.head()

,date,type,locale,locale_name,description,transferred
0,2012-03-02,Holiday,Local,Manta,Fundacion de Manta,False
1,2012-04-01,Holiday,Regional,Cotopaxi,Provincializacion de Cotopaxi,False
2,2012-04-12,Holiday,Local,Cuenca,Fundacion de Cuenca,False
3,2012-04-14,Holiday,Local,Libertad,Cantonizacion de Libertad,False
4,2012-04-21,Holiday,Local,Riobamba,Cantonizacion de Riobamba,False

In [4]:
# count the rows with data
print(holidays_evets.count())

date           350
type           350
locale         350
locale_name    350
description    350
transferred    350
dtype: int64

In [5]:
# Access oil data
oil = store_data["oil"]
oil.tail()

            date  dcoilwtico
1213  2017-08-25       47.65
1214  2017-08-28       46.40
1215  2017-08-29       46.46
1216  2017-08-30       45.96
1217  2017-08-31       47.26

In [6]:
# count of oil rows with data
print(oil.count())

date          1218
dcoilwtico    1175
dtype: int64

In [7]:
# since there few missing data rows and there is numerical data
# instead of deleting rows. It is assume there is no sale to save data
oil_filled = oil.fillna(0)
# get the count of filled rows
print(oil_filled.count())

date          1218
dcoilwtico    1218
dtype: int64

In [8]:
# access store data
stores = store_data["stores"]
stores.head()

   store_nbr           city                           state type  cluster
0          1          Quito                       Pichincha    D       13
1          2          Quito                       Pichincha    D       13
2          3          Quito                       Pichincha    D        8
3          4          Quito                       Pichincha    D        9
4          5  Santo Domingo  Santo Domingo de los Tsachilas    D        4

In [9]:
# check the empty rows of data
print(stores.count())

store_nbr    54
city         54
state        54
type         54
cluster      54
dtype: int64

In [10]:
# access train data
train = store_data["train"]
train.head()

   id        date  store_nbr      family  sales  onpromotion
0   0  2013-01-01          1  AUTOMOTIVE    0.0            0
1   1  2013-01-01          1   BABY CARE    0.0            0
2   2  2013-01-01          1      BEAUTY    0.0            0
3   3  2013-01-01          1   BEVERAGES    0.0            0
4   4  2013-01-01          1       BOOKS    0.0            0

In [11]:
# count data containing rows inside the data frame
print(train.count())

id             3000888
date           3000888
store_nbr      3000888
family         3000888
sales          3000888
onpromotion    3000888
dtype: int64

In [12]:
# Access transactions
transactions = store_data["transactions"]
transactions.tail()

             date  store_nbr  transactions
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

In [13]:
# count data containing rows 
print(transactions.count())

date            83488
store_nbr       83488
transactions    83488
dtype: int64

### Summary of Data Cleaning
Overall Data is pretty much cleaned and does not contain missing values. only oil data had some missing numerical values which were filled with 0 to safe data loss.

## Exploratory Data Analysis

In [14]:
# merge the tables to get a consolidated data set
trans_store_df = pd.merge(transactions,stores, how="right")
trans_store_df.head()

         date  store_nbr  transactions   city      state type  cluster
0  2013-01-02          1          2111  Quito  Pichincha    D       13
1  2013-01-03          1          1833  Quito  Pichincha    D       13
2  2013-01-04          1          1863  Quito  Pichincha    D       13
3  2013-01-05          1          1509  Quito  Pichincha    D       13
4  2013-01-06          1           520  Quito  Pichincha    D       13

In [15]:
# check empty data rows
print(trans_store_df.count())

date            83488
store_nbr       83488
transactions    83488
city            83488
state           83488
type            83488
cluster         83488
dtype: int64

In [16]:
# merge trans_store_df with oil
oil_merged = pd.merge(trans_store_df,oil,how="left")
oil_merged.head()

,date,store_nbr,transactions,city,state,type,cluster,dcoilwtico
0,2013-01-02,1,2111,Quito,Pichincha,D,13,93.14
1,2013-01-03,1,1833,Quito,Pichincha,D,13,92.97
2,2013-01-04,1,1863,Quito,Pichincha,D,13,93.12
3,2013-01-05,1,1509,Quito,Pichincha,D,13,NaN
4,2013-01-06,1,520,Quito,Pichincha,D,13,NaN

In [17]:
# check empty data rows
print(oil_merged.count())

date            83488
store_nbr       83488
transactions    83488
city            83488
state           83488
type            83488
cluster         83488
dcoilwtico      57848
dtype: int64

In [18]:
# fill empty numerical rows with 0 and obtain the count
oil_merged_filled = oil_merged.fillna(0)
print(oil_merged_filled.count())

date            83488
store_nbr       83488
transactions    83488
city            83488
state           83488
type            83488
cluster         83488
dcoilwtico      83488
dtype: int64

In [19]:
combined_df=pd.merge(oil_merged_filled,train,how="left")
combined_df.head()

,date,store_nbr,transactions,city,state,type,cluster,dcoilwtico,id,family,sales,onpromotion
0,2013-01-02,1,2111,Quito,Pichincha,D,13,93.14,1782,AUTOMOTIVE,2.0,0
1,2013-01-02,1,2111,Quito,Pichincha,D,13,93.14,1783,BABY CARE,0.0,0
2,2013-01-02,1,2111,Quito,Pichincha,D,13,93.14,1784,BEAUTY,2.0,0
3,2013-01-02,1,2111,Quito,Pichincha,D,13,93.14,1785,BEVERAGES,1091.0,0
4,2013-01-02,1,2111,Quito,Pichincha,D,13,93.14,1786,BOOKS,0.0,0

In [20]:
print(combined_df.count())

date            2755104
store_nbr       2755104
transactions    2755104
city            2755104
state           2755104
type            2755104
cluster         2755104
dcoilwtico      2755104
id              2755104
family          2755104
sales           2755104
onpromotion     2755104
dtype: int64

In [21]:
merged_df = combined_df.merge(holidays_evets, on="date",how="left")
merged_df.head()

,date,store_nbr,transactions,city,state,type_x,cluster,dcoilwtico,id,family,sales,onpromotion,type_y,locale,locale_name,description,transferred
0,2013-01-02,1,2111,Quito,Pichincha,D,13,93.14,1782,AUTOMOTIVE,2.0,0,NaN,NaN,NaN,NaN,NaN
1,2013-01-02,1,2111,Quito,Pichincha,D,13,93.14,1783,BABY CARE,0.0,0,NaN,NaN,NaN,NaN,NaN
2,2013-01-02,1,2111,Quito,Pichincha,D,13,93.14,1784,BEAUTY,2.0,0,NaN,NaN,NaN,NaN,NaN
3,2013-01-02,1,2111,Quito,Pichincha,D,13,93.14,1785,BEVERAGES,1091.0,0,NaN,NaN,NaN,NaN,NaN
4,2013-01-02,1,2111,Quito,Pichincha,D,13,93.14,1786,BOOKS,0.0,0,NaN,NaN,NaN,NaN,NaN

In [22]:
print(merged_df.count())

date            2805231
store_nbr       2805231
transactions    2805231
city            2805231
state           2805231
type_x          2805231
cluster         2805231
dcoilwtico      2805231
id              2805231
family          2805231
sales           2805231
onpromotion     2805231
type_y           459063
locale           459063
locale_name      459063
description      459063
transferred      459063
dtype: int64

In [23]:
# Adding the 'has_long_weekend' column based on the merged data
if 'type_x' in merged_df.columns and 'transferred' in merged_df.columns:
    merged_df['is_long_weekend'] = (merged_df['type_x'] == 'Holiday') & (merged_df['transferred'] == False)

    # Updating the original combined_df with the new column
    combined_df['is_long_weekend'] = merged_df['is_long_weekend']
else:
    print("Columns 'type' and/or 'transferred' do not exist in merged_df.")

In [24]:
# obtaining clean merged data count
print(merged_df.count())

date               2805231
store_nbr          2805231
transactions       2805231
city               2805231
state              2805231
type_x             2805231
cluster            2805231
dcoilwtico         2805231
id                 2805231
family             2805231
sales              2805231
onpromotion        2805231
type_y              459063
locale              459063
locale_name         459063
description         459063
transferred         459063
is_long_weekend    2805231
dtype: int64

In [25]:
# remove empty data rows
clean_df = merged_df.dropna()
clean_df.head()

,date,store_nbr,transactions,city,state,type_x,cluster,dcoilwtico,id,family,sales,onpromotion,type_y,locale,locale_name,description,transferred,is_long_weekend
99,2013-01-05,1,1509,Quito,Pichincha,D,13,0.0,7128,AUTOMOTIVE,5.0,0,Work Day,National,Ecuador,Recupero puente Navidad,False,False
100,2013-01-05,1,1509,Quito,Pichincha,D,13,0.0,7129,BABY CARE,0.0,0,Work Day,National,Ecuador,Recupero puente Navidad,False,False
101,2013-01-05,1,1509,Quito,Pichincha,D,13,0.0,7130,BEAUTY,3.0,0,Work Day,National,Ecuador,Recupero puente Navidad,False,False
102,2013-01-05,1,1509,Quito,Pichincha,D,13,0.0,7131,BEVERAGES,1160.0,0,Work Day,National,Ecuador,Recupero puente Navidad,False,False
103,2013-01-05,1,1509,Quito,Pichincha,D,13,0.0,7132,BOOKS,0.0,0,Work Day,National,Ecuador,Recupero puente Navidad,False,False

In [26]:
print(clean_df.count())

date               459063
store_nbr          459063
transactions       459063
city               459063
state              459063
type_x             459063
cluster            459063
dcoilwtico         459063
id                 459063
family             459063
sales              459063
onpromotion        459063
type_y             459063
locale             459063
locale_name        459063
description        459063
transferred        459063
is_long_weekend    459063
dtype: int64

In [27]:
data_df = clean_df.rename(columns={"type_x":"type","type_y":"day_type","family":"category"})
data_df.head()

,date,store_nbr,transactions,city,state,type,cluster,dcoilwtico,id,category,sales,onpromotion,day_type,locale,locale_name,description,transferred,is_long_weekend
99,2013-01-05,1,1509,Quito,Pichincha,D,13,0.0,7128,AUTOMOTIVE,5.0,0,Work Day,National,Ecuador,Recupero puente Navidad,False,False
100,2013-01-05,1,1509,Quito,Pichincha,D,13,0.0,7129,BABY CARE,0.0,0,Work Day,National,Ecuador,Recupero puente Navidad,False,False
101,2013-01-05,1,1509,Quito,Pichincha,D,13,0.0,7130,BEAUTY,3.0,0,Work Day,National,Ecuador,Recupero puente Navidad,False,False
102,2013-01-05,1,1509,Quito,Pichincha,D,13,0.0,7131,BEVERAGES,1160.0,0,Work Day,National,Ecuador,Recupero puente Navidad,False,False
103,2013-01-05,1,1509,Quito,Pichincha,D,13,0.0,7132,BOOKS,0.0,0,Work Day,National,Ecuador,Recupero puente Navidad,False,False